## Plan Result (demo-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[1]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw"
        name                = "aks01-demo-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (4 unchanged attributes hidden)

      ~ backend_address_pool {
            id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/pcq-backend-int"
          ~ name         = "pcq-backend-int" -> "lau-idam-backend"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/lau-idam-backend"
          ~ name         = "lau-idam-backend" -> "lau-idam-backend-int"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/lau-idam-backend-int"
          ~ name         = "lau-idam-backend-int" -> "lau-case-backend-int"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/lau-case-backend-int"
          ~ name         = "lau-case-backend-int" -> "pcq-backend-int"
            # (2 unchanged attributes hidden)
        }

      ~ backend_http_settings {
            id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/pcq-backend-int"
          ~ name                                = "pcq-backend-int" -> "lau-idam-backend"
          ~ probe_name                          = "pcq-backend-int" -> "lau-idam-backend"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/lau-idam-backend"
          ~ name                                = "lau-idam-backend" -> "lau-idam-backend-int"
          ~ probe_name                          = "lau-idam-backend" -> "lau-idam-backend-int"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/lau-idam-backend-int"
          ~ name                                = "lau-idam-backend-int" -> "lau-case-backend-int"
          ~ probe_name                          = "lau-idam-backend-int" -> "lau-case-backend-int"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/lau-case-backend-int"
          ~ name                                = "lau-case-backend-int" -> "pcq-backend-int"
          ~ probe_name                          = "lau-case-backend-int" -> "pcq-backend-int"
            # (7 unchanged attributes hidden)
        }

      ~ http_listener {
          ~ host_name                      = "pcq-backend-int-demo.service.core-compute-demo.internal" -> "lau-idam-backend-demo.service.core-compute-demo.internal"
            id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/pcq-backend-int"
          ~ name                           = "pcq-backend-int" -> "lau-idam-backend"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          ~ host_name                      = "lau-idam-backend-demo.service.core-compute-demo.internal" -> "lau-idam-backend-int-demo.service.core-compute-demo.internal"
            id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/lau-idam-backend"
          ~ name                           = "lau-idam-backend" -> "lau-idam-backend-int"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          ~ host_name                      = "lau-idam-backend-int-demo.service.core-compute-demo.internal" -> "lau-case-backend-int-demo.service.core-compute-demo.internal"
            id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/lau-idam-backend-int"
          ~ name                           = "lau-idam-backend-int" -> "lau-case-backend-int"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          ~ host_name                      = "lau-case-backend-int-demo.service.core-compute-demo.internal" -> "pcq-backend-int-demo.service.core-compute-demo.internal"
            id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/lau-case-backend-int"
          ~ name                           = "lau-case-backend-int" -> "pcq-backend-int"
            # (7 unchanged attributes hidden)
        }

      ~ probe {
          ~ host                                      = "pcq-backend-int-demo.service.core-compute-demo.internal" -> "lau-idam-backend-demo.service.core-compute-demo.internal"
            id                                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/probes/pcq-backend-int"
          ~ name                                      = "pcq-backend-int" -> "lau-idam-backend"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ probe {
          ~ host                                      = "lau-idam-backend-demo.service.core-compute-demo.internal" -> "lau-idam-backend-int-demo.service.core-compute-demo.internal"
            id                                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/probes/lau-idam-backend"
          ~ name                                      = "lau-idam-backend" -> "lau-idam-backend-int"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ probe {
          ~ host                                      = "lau-idam-backend-int-demo.service.core-compute-demo.internal" -> "lau-case-backend-int-demo.service.core-compute-demo.internal"
            id                                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/probes/lau-idam-backend-int"
          ~ name                                      = "lau-idam-backend-int" -> "lau-case-backend-int"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ probe {
          ~ host                                      = "lau-case-backend-int-demo.service.core-compute-demo.internal" -> "pcq-backend-int-demo.service.core-compute-demo.internal"
            id                                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/probes/lau-case-backend-int"
          ~ name                                      = "lau-case-backend-int" -> "pcq-backend-int"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (219 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1320,"Program":"tfcmt","SHA1":"","Target":"demo-cftapps_cluster_lb_backend","Vars":{}} -->